*** Settings ***

Documentation  A test suite with a tests for simple tender auction.
Suite setup       Отримати вхідні дані
Suite teardown    Close all browsers
Resource       resource.robot

*** Test Cases ***
Перевірка логіну
    Долучитись до аукціону 1 учасником
    Долучитись до аукціону 2 учасником

Очікування 1-ого раунду
    Почекати 1 min до паузи перед 1 раундом
    Перевірити інформацію про тендер
    Почекати 15s до завершення паузи перед 1 раундом

1-ий раунд
    Переключитись на 1 учасника
    Погодитись на запропоновану ставку

Очікування 2-ого раунду
    Почекати 2s до паузи перед 2 раундом
    Почекати 15s до завершення паузи перед 2 раундом
    Перевірити результати 1 раунду

2-ий раунд
    Обрати ставку з випадаючого меню

Очікування 3-ого раунду
    Почекати 2s до паузи перед 3 раундом
    Почекати 15s до завершення паузи перед 3 раундом
    Перевірити результати 2 раунду


3-ий раунд
    Переключитись на 2 учасника
    Погодитись на запропоновану ставку

Очікування 4-ого раунду
    Почекати 2s до паузи перед 4 раундом
    Почекати 15s до завершення паузи перед 4 раундом
    Перевірити результати 3 раунду


Завершення аукціону
    Дочекатистись до завершення аукціону
    Перевірити результати аукціону
